Revit 2027 API
ElementParameterFilter.GetRules Method
 Returns the set of rules contained in this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FilterRule> GetRules()
Public Function GetRules As IList(Of FilterRule)
public:
IList<FilterRule^>^ GetRules()
member GetRules : unit -> IList<FilterRule>
Return Value
IList<FilterRule>
 A copy of the set of rules.
See Also
Reference
ElementParameterFilter Class
Autodesk.Revit.DB Namespace